// // - Дано натуральное число n. Выведите все числа от 1 до n.
// let n = (argument) => {
//     for (let i = 1; i <= argument; i++) {
//         document.write(`${i}, `)
//             }
// }
// n(100);

// // - Даны два целых числа A и В .
// //     Выведите все числа от A до B включительно, в порядке возрастания,
// //     если A < B, или в порядке убывания в противном случае.
// let wtf = (a,b) => {
//     if (a<b) {
//         for (let i = a; i <= b; i++) {
//             document.write(`${i}, `)
//
//         }
//     } else if (a>b) {
//         for (let i = a; i >= b; i--) {
//             document.write(`${i}, `)
//
//         }
//     }
// }
// wtf(100,200);