// // --створити масив з:
// //     - з 5 числових значень
// // - з 5 стічкових значень
// // - з 5 значень стрічкового, числового та булевого типу
// // - та вивести його в консоль
//
// let arr1 = [1,2,3,4,5];
// for (let item1 of arr1) {
//     console.log(item1)
// }
// let arr2 = ['Не','роби','мені','нерви','!'];
// for (let item2 of arr2) {
//     console.log(item2)
// }
//
// let arr3 = ['мама', 'мила', 'раму', 10, 'або', 20, 'раз', true];
// for (let arr3Element of arr3) {
//     console.log(arr3Element)
// }

// // Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу. Вивести в консоль
//
// let arr4 = [];
//
// // - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом всередині
// // - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом і індексом всередині
// // - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом всередині.
// // - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом і індексом всередині.
//
//
// for (i=0; i<=10; i++) {
//     document.write( '<div>\'якийсь там текст 10 разів\'</div>' )
// }

for (i=0; i<=10; i++) {
    document.write(' <div> якийсь там текст ${i} разів</div>')
}




















