// Користувач вводить або має два числа.
//     Потрібно знайти та вивести максимальне число з тих двох .
//     Також потрібно врахувати коли введені рівні числа.

// let xarr = [10, 20];
// let xmax = Math.max(...xarr);
// let xmin = Math.min(...xarr);
// console.log( xmax );
//
// (xmax === xmin) ? console.log('числа рівні') : console.log('числа не рівні');


// - У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
//     Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.

// let flat = prompt('введіть номер квартири від 1 до 90')
//
// if (flat>=1 && flat<=20) {
//     console.log(flat, 'Перший підїзд');
// } else if (flat>=21 && flat<=48) {
//     console.log(flat, 'Другий підїзд');
// } else if (flat>=49 && flat<=90) {
//     console.log(flat, 'Третій підїзд');
// }
// else    {
//     console.log(flat, 'то певно підвал');
// }
//
// - Ми маємо змінну number в яку користувач задає числове значення,
//     якщо змінна рівна 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО

// (+prompt('Цифру вводь!') === 10) ? console.log('вірно') : console.log('Не вірно');


// - Ми маємо змінну x в яку користувач задає  значення,  якщо в змінну записане число, вивести 1,
//     якщо в змінну записали стрінгу вивести 2, якщо булеве значення - 3, якщо об'єкт або масив - 3.
// якщо в змінну записали щось інше, спрацьовує else
//
// let x = 'sfsdfsd'; // string
// let x = [3,4,6]; // object
//
// if (typeof x === "number") {
//     console.log(1);
// } else if ( typeof x === "string") {
//     console.log(2)
// } else if ( typeof x === "boolean") {
//     console.log(3)
// } else if (typeof x === "object") {
//     console.log(4)
// } else {
//     console.log('hmmmm')
// }

















